import React, { Fragment } from 'react';
import { storiesOf } from '@storybook/react';
import { Divider } from '../../index';
import Story from '../../../.storybook/components/Story';


storiesOf('Divider', module)
  .add('code', () => (
    <Fragment>
      <Story.Header
        title="קו מפריד"
        info="רכיב שמאפשר הוספה של קו מפריד בין פריטים"
      />
      <Story.Group>
        <Story
          title="שימוש רגיל"
          info="קו מפריד אופקי בין פריטים. ניתן להגדיר קו מקווקו"
        >
          <div>
            <p>
              בחום של 40 מעלות ויותר בקיצים הטרופים של  חלום רחוק בכ-3.5 מטרים מקו המפלס כיום וחגיגת גשמים של כ-420 מ"מ בממוצע הרב שנתי. פלא שחקלאות עמק הירדן השתוללה. מסיבות יום העצמאות של הקבוצה נערכו על במה שהוקמה בתוך המים, על עמודים, ואפילו היה צורך בגשר כדי להגיע אליה.
            </p>
            <Divider />
            <p>
              החפירות הארכיאולוגיות בשושן החלו כבר במאה ה-19 ומתנהלות לאורך כ-150 שנה. בשנות ה-60 נוהלו החפירות על ידי המשלחת הצרפתית לחקר פרס. בראש החפירה מונה לעמוד הארכיאולוג הצרפתי, פרופ' ז'אן פרו, אשר קודם לכן עבד בארץ ישראל והיה שותף למספר חפירות שנוהלו בארץ.
            </p>
            <Divider dashed />
            <p>
              התרבות שלנו לא יודעת לחנך להזדקנות, ויותר מכך – מתקשה לאפשר לייצוגים של זיקנה להיחשף בציבור מתוך תפישת עולם שיש להעלים את
              בגידת הגוף. אומנם בשנים האחרונות השכלנו לגדל ערוגות של סובלנות לצדדים רבים של הקיום, אך אנחנו עדיין מתקשים לסלוח לאנשים שמזדקנים, בעיקר אם הם עושים זאת בגאווה מול המצלמות.
            </p>
          </div>
        </Story>

        <Story
          title="קו עם טקסט"
          info="ניתן להוסיף טקסט לקו המפריד בימין, שמאל או מרכז"
        >
          <div>
            <p>
              בחום של 40 מעלות ויותר בקיצים הטרופים של עמק הירדן - הכנרת הייתה מזגן. מדי ערב היו יורדים חברי הקבוצה לרחוץ באגם וחיי חברה שלמים, סואלה. מסיבות יום העצמאות של הקבוצה נערכו על במה שהוקמה בתוך המים, על עמודים, ואפילו היה צורך בגשר כדי להגיע אליה.
            </p>
            <Divider>כותרת מפרידה</Divider>
            <p>
              החפירות הארכיאולוגיות בשושן החלו כבר במאה ה-19 ומתנהלות לאורך כ-150 שנה. בשנות ה-60 נוהלו החפירות על ידי המשלחת הצרפתית לחקר פרס. בראש החפירה מונה לעמוד הארכיאולוג הצרפתי, פרופ' ז'אן פרו, אשר קודם לכן עבד בארץ ישראל והיה שותף למספר חפירות שנוהלו בארץ.
            </p>
            <Divider orientation="right">כותרת בצד ימין</Divider>
            <p>
              התרבות שלנו לא יודעת לחנך להזדקנות, ויותר מכך – מתקשה לאפשר לייצוגים של זיקנה להיחשף בציבור מתוך תפישת עולם שיש להעלים את
              בגידת הגוף. אומנם בשנים האחרונות השכלנו לגדל ערוגות של סובלנות לצדדים רבים של הקיום, אך אנחנו עדיין מתקשים לסלוח לאנשים שמזדקנים, בעיקר אם הם עושים זאת בגאווה מול המצלמות.
            </p>
            <Divider orientation="left">כותרת בצד שמאל</Divider>
            <p>
              אחרי כמעט עשור בתל אביב, שמתוכו חיה שש שנים כדיילת אוויר שבהן יצאה בכל ערב פנוי, פקדה את ניו יורק לפחות פעמיים בחודש, עבדה כמאפרת בבקרים או השלימה שעות שינה מג'ט לג אכזרי - החליטה ליאור לרר כי אורח החיים הזה כבר לא מתאים לה ושהיא חוזרת, בגיל 31, לבית של ההורים בכפר תבור. "הייתי אז בת 25, דיילת אוויר ורווקה בפעם הראשונה בחיי, אז את יכולה לתאר את הבלגן.
            </p>
          </div>
        </Story>

        <Story
          title="קו אנכי"
          info="במידת הצורך ניתן להגדיר את הקו כקו אנכי שיפריד בין רשימה של פריטי טקסט אנכיים"
        >
          <div>
            <span>טקסט</span>
            <Divider vertical />
            <a href="#">קישור</a>
            <Divider vertical />
            <a href="#">קישור שני</a>
          </div>
        </Story>
      </Story.Group>
      <Story.PropsTable type={Divider} />
    </Fragment>
  ))
